[
  {
    "topic": "travel",
    "label": "Planning a Trip",
    "dialogues": [
      {
        "text": "I'm looking to book a flight to Tokyo for next month.",
        "options": [
          "Would you like a window or aisle seat?",
          "Our flights to Tokyo are fully booked until next year.",
          "Can I offer you a special meal for the flight?",
          "Do you have any discounts for frequent flyers?"
        ],
        "correct": "Would you like a window or aisle seat?",
        "sender": "Travel Agent"
      },
      {
        "text": "I would prefer an aisle seat, please. And could you check if there are any available upgrades?",
        "options": [
          "Sure, we have a business class seat available for an extra fee.",
          "I'm sorry, but we don't provide upgrades.",
          "Would you like to add travel insurance to your booking?",
          "How many bags will you be checking in?"
        ],
        "correct": "Sure, we have a business class seat available for an extra fee.",
        "sender": "Travel Agent"
      },
      {
        "text": "Great, I'll take the upgrade. How much extra luggage allowance does that include?",
        "options": [
          "Business class includes two additional checked bags.",
          "You can carry on one personal item and one bag.",
          "The luggage allowance is the same for all classes.",
          "We charge $50 for each additional checked bag."
        ],
        "correct": "Business class includes two additional checked bags.",
        "sender": "Travel Agent"
      },
      {
        "text": "Perfect, and what are the options for in-flight meals?",
        "options": [
          "We offer a variety of meals, including vegetarian and gluten-free options.",
          "Meals are not included in business class tickets.",
          "You need to purchase meals separately at the airport.",
          "We only serve snacks on domestic flights."
        ],
        "correct": "We offer a variety of meals, including vegetarian and gluten-free options.",
        "sender": "Travel Agent"
      }
    ]
  }
]